:PROPERTIES:
:ID:       2eebfdfb-e401-4d9c-a7f0-7d6ca47585ad
:END:
#+title: Programming - Computer Science

* Computer Science concepts

** Design patterns
*** References
[[https://refactoring.guru/design-patterns/catalog][The Catalog of Design Patterns]]
*** Creation
*** Structural
*** Behavioral

** Layered Architecture in Computer Networks
*** TODO [[https://en.wikipedia.org/wiki/OSI_model][OSI model - Wikipedia]]

** Misc
*** First Class citizen
A First Class Citizen is an entity that can be assigned to a variable, passed as an argument to a function, returned from a function, and has properties and methods assigned to it.

*** First Class Functions
A language supports =first class function= if it treats functions as first class citizen (e.g. can pass a function as an argument to a function).

Taken from a GeeksForGeeks tutorial
**** treat function as a value
#+begin_src js
let greet = function () {
    console.log("Welcome to GeeksforGeeks!");
}
greet();
#+end_src

#+RESULTS:
: Welcome to GeeksforGeeks!
: undefined

**** pass a function as a parameter
#+begin_src js
function student(){
    return "Student";
}

function greet(user){
    console.log("Welcome", user());
}

// Prints "Welcome Student"
let message1 = greet(student);
#+end_src

#+RESULTS:
: Welcome Student
: undefined

**** return a function from another function
#+begin_src js
let greet = function () {
    return function () {
        console.log("Welcome to GeeksforGeeks!");
    }
}
greet()();
#+end_src

#+RESULTS:
: Welcome to GeeksforGeeks!
: undefined
